class Reals {
  /**
   * 主键id 自增
   */
  id?: number;

  /**
   * 设备ID
   */
  fac_id = 0;

  /**
   * 数据插入时间
   */
  data_time = 0;

  /**
   * 要素1
   */
  e1 = 0;

  /**
   * 要素2
   */
  e2 = 0;

  /**
   * 要素3
   */
  e3 = 0;

  /**
   * 要素4
   */
  e4 = 0;

  /**
   * 要素5
   */
  e5 = 0;

  /**
   * 要素6
   */
  e6 = 0;

  /**
   * 要素7
   */
  e7 = 0;

  /**
   * 要素8
   */
  e8 = 0;

  /**
   * 要素9
   */
  e9 = 0;

  /**
   * 要素10
   */
  e10 = 0;

  /**
   * 要素11
   */
  e11 = 0;

  /**
   * 要素12
   */
  e12 = 0;

  /**
   * 要素13
   */
  e13 = 0;

  /**
   * 要素14
   */
  e14 = 0;

  /**
   * 要素15
   */
  e15 = 0;

  /**
   * 要素16
   */
  e16 = 0;

  /**
   * 继电器1
   */
  JK1 = 0;

  /**
   * 继电器2
   */
  JK2 = 0;

  /**
   * 继电器3
   */
  JK3 = 0;

  /**
   * 继电器4
   */
  JK4 = 0;

  /**
   * 继电器5
   */
  JK5 = 0;

  /**
   * 继电器6
   */
  JK6 = 0;

  /**
   * 继电器7
   */
  JK7 = 0;

  /**
   * 继电器8
   */
  JK8 = 0;

  /**
   * 继电器9
   */
  JK9 = 0;

  /**
   * 继电器10
   */
  JK10 = 0;

  /**
   * 继电器11
   */
  JK11 = 0;

  /**
   * 继电器12
   */
  JK12 = 0;

  /**
   * 继电器13
   */
  JK13 = 0;

  /**
   * 继电器14
   */
  JK14 = 0;

  /**
   * 继电器15
   */
  JK15 = 0;

  /**
   * 继电器16
   */
  JK16 = 0;

  /**
   * 继电器17
   */
  JK17 = 0;

  /**
   * 继电器18
   */
  JK18 = 0;

  /**
   * 继电器19
   */
  JK19 = 0;

  /**
   * 继电器20
   */
  JK20 = 0;

  /**
   * 继电器21
   */
  JK21 = 0;

  /**
   * 继电器22
   */
  JK22 = 0;

  /**
   * 继电器23
   */
  JK23 = 0;

  /**
   * 继电器24
   */
  JK24 = 0;

  /**
   * 继电器25
   */
  JK25 = 0;

  /**
   * 继电器26
   */
  JK26 = 0;

  /**
   * 继电器27
   */
  JK27 = 0;

  /**
   * 继电器28
   */
  JK28 = 0;

  /**
   * 继电器29
   */
  JK29 = 0;

  /**
   * 继电器30
   */
  JK30 = 0;

  /**
   * 继电器31
   */
  JK31 = 0;

  /**
   * 继电器32
   */
  JK32 = 0;
}
export default Reals
